public class Study24 {
    
    public static void main(String[] args) {
        // Q1. 자판기 프로그램을 만들기 위해서 필요한 기술은 무엇인가요?
        // 1. 조건문(if문)
        // 2. 입출력관련 내용
        // 3. 상품에 대한 정보 필요
        // 4. 상품의 정보가 연계되는 자료형인 맵과 같은 데이터가 필요하다.
        // 5. 조건문
        // 6. 프로그램 언어인 자바가 필요하다.
        // 7. 2차원 배열이 필요하다.

        // 요구사항
        // 1. 반복 입력 받을 수 있도록 (반복문과 입력(System.in) 필수)
        // 2. 프로그램 시작 시 인사 말이 출력 되도록 할것.
        // 3. 프로그램 종료를 위해서 입력으로 "EXIT" 값으로 받으면 종료 되도록 할것.
        
    }
}
